[
  {
    "title": "Elden Ring",
    "linkTitle": "elden-ring",
    "genres": [
      "Action",
      "RPG",
      "Open World"
    ],
    "rating": "M",
    "cardDescription": "A fantasy action RPG developed by FromSoftware and published by Bandai Namco Entertainment.",
    "gameOverview": "Elden Ring is an action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment. The game is set in the Lands Between, after the destruction of the titular Elden Ring and the scattering of its shards, the Great Runes. Players must traverse the realm to find all the Great Runes, restore the Elden Ring, and become the Elden Lord. The game features open world exploration, challenging and rewarding combat, character customization, and a rich and complex story. Elden Ring is a challenging but rewarding experience that is sure to please fans of action role-playing games. Elden Ring is a great choice for players who are looking for a challenging but rewarding experience with a great story, open world exploration, and exciting gameplay. ",
    "price": 59.99,
    "image": "https://www.zeldadungeon.net/wp-content/uploads/2022/04/eldenringbannerRS.jpg",
    "trailer": "https://www.youtube.com/embed/E3Huy2cdih0",
    "PS": "https://store.playstation.com/en-us/concept/10000333",
    "XB": "https://www.xbox.com/en-US/games/elden-ring",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1245620/ELDEN_RING/"
  },
  {
    "title": "Grand Theft Auto V",
    "linkTitle": "grand-theft-auto-v",
    "genres": [
      "Action",
      "Open World"
    ],
    "rating": "M",
    "cardDescription": "An action-adventure game developed by Rockstar North and published by Rockstar Games.",
    "gameOverview": "Grand Theft Auto V is an action-adventure game developed by Rockstar North and published by Rockstar Games. The game is set in the fictional city of Los Santos, based on Los Angeles, and follows three protagonists Michael De Santa, Franklin Clinton, and Trevor Phillips—as they plan and execute heists while under pressure from law enforcement and powerful criminal organization Grand Theft Auto V is a critically acclaimed game, with praise for its open world design, gameplay, and story. It has been one of the best-selling video games of all time, with over 160 million copies sold worldwid Grand Theft Auto V is a great choice for players who are looking for an exciting and immersive experience with a great story, open world exploration, and exciting gameplay.",
    "price": 39.99,
    "image": "https://virtualbackgrounds.site/wp-content/uploads/2021/02/grand-theft-auto-v-cover-art.jpg",
    "trailer": "https://www.youtube.com/embed/hvoD7ehZPcM",
    "PS": "https://www.playstation.com/en-us/games/grand-theft-auto-v",
    "XB": "https://www.xbox.com/en-US/games/store/grand-theft-auto-v-xbox-one/BPJ686W6S0NH/0001",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/271590/Grand_Theft_Auto_V/"
  },
  {
    "title": "The Legend of Zelda: Breath of the Wild",
    "linkTitle": "the-legend-of-zelda-breath-of-the-wild",
    "genres": [
      "Action",
      "Adventure",
      "Open World"
    ],
    "rating": "E10+",
    "cardDescription": "An action-adventure game developed and published by Nintendo.",
    "gameOverview": "The Legend of Zelda: Breath of the Wild is an action-adventure game developed and published by Nintendo. The game is set in the fictional land of Hyrule, and follows Link, a Hylian knight who awakens from a 100-year slumber to find a ruined kingdom. Players must explore the open world of Hyrule, battle enemies, solve puzzles, and collect items to restore the kingdom and defeat Ganon, the game's main antagonist. The Legend of Zelda: Breath of the Wild is a critically acclaimed game, with praise for its open world design, gameplay, and story. It has been one of the best-selling video games of all time, with over 25 million copies sold worldwide. The Legend of Zelda: Breath of the Wild is a great choice for players who are looking for an open-world adventure game with a great story, challenging gameplay, and stunning visuals.",
    "price": 59.99,
    "image": "https://cdn.wccftech.com/wp-content/uploads/2017/01/Zelda-Breath-of-the-Wild-screenshots6.jpg",
    "trailer": "https://www.youtube.com/embed/1rPxiXXxftE",
    "PS": "",
    "XB": "",
    "Switch": "https://www.nintendo.com/store/products/the-legend-of-zelda-breath-of-the-wild-expansion-pass-switch",
    "PC": ""
  },
  {
    "title": "Red Dead Redemption 2",
    "linkTitle": "red-dead-redemption-2",
    "genres": [
      "Action",
      "Adventure",
      "Open World"
    ],
    "rating": "M",
    "cardDescription": "An action-adventure game developed by Rockstar Studios and published by Rockstar Games.",
    "gameOverview": "Red Dead Redemption 2 is an open-world action-adventure game developed and published by Rockstar Games. It is the sequel to 2010's Red Dead Redemption and was released for PlayStation 4 and Xbox One on October 26, 2018. The game is set in the fictional American frontier of the late 19th century and follows the story of Arthur Morgan, a member of the Van der Linde gang. The game is known for its realistic graphics, immersive gameplay, and engaging story. Players can explore the vast open world, complete a variety of missions, and interact with the many characters they encounter. The game also features a detailed crafting system, allowing players to create their own weapons, ammunition, and other items. Red Dead Redemption 2 is a mature game, and contains graphic violence, strong language, and sexual content. However, the game is also a well-crafted masterpiece, and is sure to please fans of the Western genre.",
    "price": 39.99,
    "image": "https://www.rocketchainsaw.com.au/wp-content/uploads/2018/05/Red-Dead-Redemption-2-New-Logo.jpg",
    "trailer": "https://www.youtube.com/embed/eaW0tYpxyp0",
    "PS": "https://www.playstation.com/en-us/games/red-dead-redemption-2/",
    "XB": "https://www.xbox.com/en-US/games/store/red-dead-redemption-2/9N2ZDN7NWQKV/0010",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1174180/Red_Dead_Redemption_2/"
  },
  {
    "title": "Super Mario Odyssey",
    "linkTitle": "super-mario-odyssey",
    "genres": [
      "Platformer"
    ],
    "rating": "E",
    "cardDescription": "A platform game developed and published by Nintendo.",
    "gameOverview": "Red Dead Redemption 2 is an open-world action-adventure game developed and published by Rockstar Games. It is the sequel to 2010's Red Dead Redemption and was released for PlayStation 4 and Xbox One on October 26, 2018. The game is set in the fictional American frontier of the late 19th century and follows the story of Arthur Morgan, a member of the Van der Linde gang. The game is known for its realistic graphics, immersive gameplay, and engaging story. Players can explore the vast open world, complete a variety of missions, and interact with the many characters they encounter. The game also features a detailed crafting system, allowing players to create their own weapons, ammunition, and other items. Red Dead Redemption 2 is a mature game, and contains graphic violence, strong language, and sexual content. However, the game is also a well-crafted masterpiece, and is sure to please fans of the Western genre. If you are a fan of Western games, or are looking for a mature and immersive open-world experience, then Red Dead Redemption 2 is definitely worth checking out.",
    "price": 49.99,
    "image": "https://www.gamespot.com/a/uploads/original/1597/15971423/3828643-4944281787-3307356-4408074781-4376aef55bbee8791e8a8ab75a7f99b1.jpg",
    "trailer": "https://www.youtube.com/embed/wGQHQc_3ycE",
    "PS": "",
    "XB": "",
    "Switch": "https://www.nintendo.com/store/products/super-mario-odyssey-switch/",
    "PC": ""
  },
  {
    "title": "God of War",
    "linkTitle": "god-of-war",
    "genres": [
      "Action",
      "Adventure",
      "Hack and slash"
    ],
    "rating": "M",
    "cardDescription": "An action-adventure game developed by Santa Monica Studio and published by Sony Interactive Entertainment.",
    "gameOverview": "God of War is an action-adventure game developed by Santa Monica Studio and published by Sony Interactive Entertainment. It was released for the PlayStation 4 on April 20, 2018. The game is the eighth installment in the God of War series, the sequel to 2010's God of War III, and the reboot of the series. The game is set in the world of Norse mythology and follows the story of Kratos, the former Greek god of war, as he tries to live a peaceful life with his son, Atreus. However, Kratos' past soon catches up to him, and he is forced to embark on a journey to the highest peak of the Nine Realms in order to spread the ashes of his deceased wife, Faye. God of War is a third-person action-adventure game with a focus on close-quarters combat. Players use Kratos' signature Blades of Chaos to battle a variety of enemies, including gods, monsters, and humans. The game also features a variety of puzzles and platforming challenges. God of War was a critical and commercial success, receiving praise for its graphics, gameplay, and story.",
    "price": 49.99,
    "image": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2021/07/god-of-war-1.jpg",
    "trailer": "https://www.youtube.com/embed/K0u_kAWLJOA",
    "PS": "https://www.playstation.com/en-us/games/god-of-war/",
    "XB": "",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1593500/God_of_War/"
  },
  {
    "title": "Horizon Forbidden West",
    "linkTitle": "horizon-forbidden-west",
    "genres": [
      "Action",
      "Adventure",
      "Open World"
    ],
    "rating": "T",
    "cardDescription": "An action role-playing game developed by Guerrilla Games and published by Sony Interactive Entertainment.",
    "gameOverview": "Horizon Forbidden West is an action role-playing game developed by Guerrilla Games and published by Sony Interactive Entertainment. It is a sequel to 2017's Horizon Zero Dawn, and was released for PlayStation 4 and PlayStation 5 on February 18, 2022. The game is set in a post-apocalyptic world where humans live alongside machines. Players control Aloy, a hunter and archer who sets out on a journey to the Forbidden West to find a cure for a mysterious plague. Horizon Forbidden West is known for its beautiful graphics, immersive gameplay, and engaging story. Players can explore the vast open world, complete a variety of quests, and interact with the many characters they encounter. The game also features a detailed crafting system, allowing players to create their own weapons, ammunition, and other items. Horizon Forbidden West is a must-play for fans of action role-playing games or anyone looking for a visually stunning and immersive experience. The game has been praised by critics for its graphics, gameplay, story, and characters. It has also been a commercial success, selling over 20 million copies worldwide.",
    "price": 59.99,
    "image": "https://twistedvoxel.com/wp-content/uploads/2020/07/horizon-forbidden-west-boxart-2.jpg",
    "trailer": "https://www.youtube.com/embed/Lq594XmpPBg?controls=0",
    "PS": "playstation.com/en-us/games/horizon-forbidden-west/",
    "XB": "",
    "Switch": "",
    "PC": ""
  },
  {
    "title": "Ratchet & Clank: Rift Apart",
    "linkTitle": "ratchet-and-clank-rift-apart",
    "genres": [
      "Platformer",
      "Third-person shooter"
    ],
    "rating": "E10+",
    "cardDescription": "A 3D platform game developed by Insomniac Games and published by Sony Interactive Entertainment.",
    "gameOverview": "Ratchet & Clank: Rift Apart is a 3D platform game developed by Insomniac Games and published by Sony Interactive Entertainment. It was released for PlayStation 5 on June 11, 2021. The game is the 13th installment in the Ratchet & Clank series, and the first to be developed exclusively for the PlayStation 5. The game follows Ratchet and Clank as they travel across multiple dimensions to stop Dr. Nefarious from taking control of the multiverse. Players use a variety of weapons and gadgets to battle enemies, solve puzzles, and explore the game's many worlds.  Ratchet & Clank: Rift Apart is known for its stunning visuals, innovative gameplay, and humor. The game has been praised by critics for its graphics, gameplay, story, and characters. It has also been a commercial success, selling over 1.1 million copies worldwide. If you are a fan of platformers or are looking for a visually stunning and innovative experience, then Ratchet & Clank: Rift Apart is definitely worth checking out.",
    "price": 49.99,
    "image": "https://assets-prd.ignimgs.com/2021/02/11/screenshot-2021-02-11-rcra-keyart-primary-16x9-20210208-jpg-webp-image-1088-612-pixels-1613060167777.jpg",
    "trailer": "https://www.youtube.com/embed/jeoad16CkSo?controls=0",
    "PS": "https://www.playstation.com/en-us/games/ratchet-and-clank-rift-apart/",
    "XB": "",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1895880/Ratchet__Clank_Rift_Apart/"
  },
  {
    "title": "God of War Ragnarök",
    "linkTitle": "god-of-war-ragnarok",
    "genres": [
      "Action",
      "Adventure",
      "Hack and slash"
    ],
    "rating": "M",
    "cardDescription": "An action-adventure game developed by Santa Monica Studio and published by Sony Interactive Entertainment.",
    "gameOverview": "God of War Ragnarök is an upcoming action-adventure game developed by Santa Monica Studio and published by Sony Interactive Entertainment. It is the sequel to 2018's God of War and is scheduled to be released for PlayStation 4 and PlayStation 5 in 2022. The game is set in the world of Norse mythology and follows the story of Kratos and Atreus as they journey to Jotunheim, the realm of the giants. God of War Ragnarök is known for its stunning visuals, innovative gameplay, and humor. The game features a variety of new features, including a new skill tree, a new crafting system, and a new photo mode. Players can also expect to see new enemies, new puzzles, and new locations. God of War Ragnarök is a must-play for fans of action-adventure games or are looking for a visually stunning and innovative experience. The game has been praised by critics for its graphics, gameplay, story, and characters. It has also been a commercial success, selling over 1 million copies worldwide.",
    "price": 59.99,
    "image": "https://static1.thegamerimages.com/wordpress/wp-content/uploads/2021/09/GodofWarRagnarok.jpg",
    "trailer": "https://www.youtube.com/embed/hfJ4Km46A-0?controls=0",
    "PS": "https://www.playstation.com/en-us/games/god-of-war-ragnarok/",
    "XB": "",
    "Switch": "",
    "PC": ""
  },
  {
    "title": "Spider-Man: Miles Morales",
    "linkTitle": "spider-man-miles-morales",
    "genres": [
      "Action",
      "Adventure",
      "3D platformer"
    ],
    "rating": "T",
    "cardDescription": "An action-adventure game developed by Insomniac Games and published by Sony Interactive Entertainment.",
    "gameOverview": "Spider-Man: Miles Morales is an action-adventure game developed by Insomniac Games and published by Sony Interactive Entertainment. It is a standalone expansion to 2018's Marvel's Spider-Man and was released for PlayStation 4 and PlayStation 5 on November 12, 2020. The game is set in the Marvel's Spider-Man universe and follows the story of Miles Morales, a young man who inherits the powers of Spider-Man from Peter Parker. Spider-Man: Miles Morales is known for its vibrant visuals, immersive gameplay, and engaging story. Players can explore the snowy streets of Harlem, complete a variety of missions, and interact with the many characters they encounter. The game also features a detailed crafting system, allowing players to create their own suits and gadgets. Spider-Man: Miles Morales is a must-play for fans of action-adventure games or are looking for a visually stunning and immersive experience. The game has been praised by critics for its graphics, gameplay, story, and characters. It has also been a commercial success, selling over 3 million copies worldwide.",
    "price": 49.99,
    "image": "https://assets1.ignimgs.com/2020/07/09/50094555187-7f5e4b4325-o-1594314477109_160w.jpg?width=1280",
    "trailer": "https://www.youtube.com/embed/NTunTURbyUU?controls=0",
  "PS": "https://www.playstation.com/en-us/games/marvels-spider-man-miles-morales/",
  "XB": "",
  "Switch": "",
  "PC": "https://store.steampowered.com/app/1817190/Marvels_SpiderMan_Miles_Morales/"
  },
  {
    "title": "Ghost of Tsushima",
    "linkTitle": "ghost-of-tsushima",
    "genres": [
      "Action",
      "Adventure",
      "Open World"
    ],
    "rating": "M",
    "cardDescription": "An action-adventure game developed by Sucker Punch Productions and published by Sony Interactive Entertainment.",
    "gameOverview": "Ghost of Tsushima is an open-world action-adventure game developed by Sucker Punch Productions and published by Sony Interactive Entertainment. It was released for PlayStation 4 on July 17, 2020. The game is set in Tsushima Island in 1274, during the first Mongol invasion of Japan. Players control Jin Sakai, a samurai who must use unconventional means to protect his home from the invaders. Ghost of Tsushima is known for its beautiful visuals, immersive gameplay, and engaging story. Players can explore the vast open world, complete a variety of missions, and interact with the many characters they encounter. The game also features a detailed combat system, allowing players to choose between traditional samurai combat and the more stealthy 'Ghost' tactics. Ghost of Tsushima is a must-play for fans of open-world games or are looking for a visually stunning and immersive experience. The game has been praised by critics for its graphics, gameplay, story, and characters. It has also been a commercial success, selling over 8 million copies worldwide.",
    "price": 59.99,
    "image": "https://mp1st.com/wp-content/uploads/2021/06/Ghost-of-Tsushima-PC-version.jpg",
    "trailer": "https://www.youtube.com/embed/rTNfgIAi3pY?controls=0",
    "PS": "https://www.playstation.com/en-us/games/ghost-of-tsushima/",
    "XB": "",
    "Switch": "",
    "PC": ""
  },
  {
    "title": "Cyberpunk 2077",
    "linkTitle": "cyberpunk-2077",
    "genres": [
      "Action",
      "Adventure",
      "Open World"
    ],
    "rating": "M",
    "cardDescription": "An action role-playing game developed and published by CD Projekt.",
    "gameOverview": "Cyberpunk 2077 is an open-world action-adventure role-playing game developed and published by CD Projekt Red. It was released for Microsoft Windows, PlayStation 4, and Xbox One on December 10, 2020, and for PlayStation 5 and Xbox Series X/S in 2021. The game is set in Night City, a megalopolis obsessed with power, glamor, and ceaseless body modification. Players assume the role of V, a mercenary who can acquire skills in hacking and machinery with options for melee and ranged combat. Cyberpunk 2077 is known for its detailed world design, immersive gameplay, and engaging story. Players can explore the vast open world, complete a variety of missions, and interact with the many characters they encounter. The game also features a detailed character customization system, allowing players to create their own V. Cyberpunk 2077 was a commercial success, selling over 13 million copies worldwide. However, the game was also met with criticism for its buggy launch and technical issues. CD Projekt Red has since released a number of patches to address these issues, and the game is now in a much more stable state.",
    "price": 59.99,
    "image": "https://cdna.artstation.com/p/assets/images/images/033/037/886/large/artur-tarnowski-malemain.jpg?1608208334",
    "trailer": "https://www.youtube.com/embed/8X2kIfS6fb8?controls=0",
    "PS": "https://www.playstation.com/en-us/games/cyberpunk-2077/",
    "XB": "https://www.xbox.com/en-US/games/store/cyberpunk-2077/BX3M8L83BBRW/0001",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1091500/Cyberpunk_2077/"
  },
  {
    "title": "Celeste",
    "linkTitle": "celeste",
    "genres": [
      "Platformer",
      "Metroidvania"
    ],
    "rating": "E10+",
    "cardDescription": "A 2D platformer with a focus on precision and difficulty. It has a great story and a soundtrack that will stay with you long after you finish the game.",
    "gameOverview": "Celeste is a platform game developed by Matt Makes Games and published by Nicalis. It was released for Microsoft Windows, macOS, Linux, PlayStation 4, Nintendo Switch, Xbox One, and Stadia on January 25, 2018. The game follows Madeline, a young woman who climbs Celeste Mountain to overcome her anxiety and self-doubt. Celeste is known for its challenging platforming, tight controls, and emotional story. Players must climb Celeste Mountain, facing a variety of obstacles and enemies along the way. The game also features a story mode, where players learn more about Madeline's past and her motivations for climbing the mountain. Celeste was a critical and commercial success, receiving praise for its gameplay, story, and music. The game has been awarded numerous accolades, including the Game of the Year award from IGN and The Game Awards.",
    "price": 19.99,
    "image": "https://cdn.mobygames.com/covers/9047370-celeste-nintendo-switch-front-cover.jpg",
    "trailer": "https://www.youtube.com/embed/70d9irlxiB4?controls=0",
    "PS": "https://www.playstation.com/en-us/games/celeste/",
    "XB": "https://www.xbox.com/en-US/games/store/celeste/BWMQL2RPWBHB/0001",
    "Switch": "https://www.nintendo.com/store/products/celeste-switch/",
    "PC": "https://store.steampowered.com/app/504230/Celeste/"
  },
  {
    "title": "Hollow Knight",
    "linkTitle": "hollow-knight",
    "genres": [
      "Metroidvania",
      "Action",
      "Adventure"
    ],
    "rating": "E10+",
    "cardDescription": "A 2D metroidvania with a beautiful world to explore and challenging boss fights. It's a must-play for fans of the genre.",
    "gameOverview": "Hollow Knight is a 2D action-adventure metroidvania developed and published by Team Cherry. It was released for Microsoft Windows, macOS, Linux, PlayStation 4, Nintendo Switch, and Xbox One in 2017. The game is set in Hallownest, a fallen kingdom inhabited by insects. Players control the Knight, a nameless insectoid warrior who must explore Hallownest and uncover its secrets. Hollow Knight is known for its challenging gameplay, vast interconnected world, and rich lore. Players can explore Hallownest at their own pace, finding new areas, bosses, and secrets. The game also features a variety of abilities that can be unlocked as the Knight progresses, allowing players to explore more difficult areas. Hollow Knight was a critical and commercial success, receiving praise for its gameplay, art style, and music. The game has been awarded numerous accolades, including the Game of the Year award from IGN and The Game Awards.",
    "price": 14.99,
    "image": "https://assets.nintendo.com/image/upload/c_fill,w_1200/q_auto:best/f_auto/dpr_2.0/ncom/software/switch/70010000003208/4643fb058642335c523910f3a7910575f56372f612f7c0c9a497aaae978d3e51",
    "trailer": "https://www.youtube.com/embed/nSPJXlYjENE?controls=0",
    "PS": "https://www.playstation.com/en-us/games/hollow-knight-voidheart-edition/",
    "XB": "https://www.xbox.com/en-US/games/store/hollow-knight-voidheart-edition/9MW9469V91LM/0010",
    "Switch": "https://www.nintendo.com/store/products/hollow-knight-switch/",
    "PC": "https://store.steampowered.com/app/367520/Hollow_Knight/"
  },
  {
    "title": "The Outer Wilds",
    "linkTitle": "the-outer-wilds",
    "genres": [
      "Adventure",
      "Exploration"
    ],
    "rating": "M",
    "cardDescription": "An open-world exploration game set in a solar system full of mysteries to uncover. It's a game that rewards curiosity and exploration.",
    "gameOverview": "The Outer Worlds is an action role-playing video game developed by Obsidian Entertainment and published by Private Division. It was released for Microsoft Windows, PlayStation 4, Xbox One, and macOS on October 25, 2019. The game is set in Halcyon, a space colony that has been abandoned by its corporate owners. Players control a colonist who must explore the colony and uncover the secrets behind its abandonment. The Outer Worlds is known for its humor, player choice, and open-ended gameplay. Players can explore Halcyon at their own pace, completing a variety of quests and interacting with the many characters they encounter. The game also features a variety of ways to approach quests, allowing players to choose whether to be stealthy, diplomatic, or even violent. The Outer Worlds was a critical and commercial success, receiving praise for its writing, gameplay, and humor. The game has been awarded numerous accolades, including the Game of the Year award from Game Informer.",
    "price": 29.99,
    "image": "https://uppercutcrit.com/wp-content/uploads/2019/12/cover.jpeg",
    "trailer": "https://www.youtube.com/embed/d6LGnVCL1_A?controls=0",
    "PS": "https://www.playstation.com/en-us/games/outer-wilds/",
    "XB": "https://www.xbox.com/en-US/games/store/outer-wilds/C596FKDKMQN7/0001",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1622100/Outer_Wilds__Echoes_of_the_Eye/"
  },
  {
    "title": "Returnal",
    "linkTitle": "returnal",
    "genres": [
      "Action",
      "Adventure",
      "Roguelike"
    ],
    "rating": "T",
    "cardDescription": "A roguelike action-adventure game with a unique gameplay loop. You play as Selene, a woman who is trapped on a planet that resets every time she dies.",
    "gameOverview": "Returnal is a third-person roguelike action-adventure game developed by Housemarque and published by Sony Interactive Entertainment. It was released for PlayStation 5 on April 30, 2021. The game follows Selene, an astronaut who crash-lands on a planetoid and must find a way to escape. However, Selene is trapped in a time loop, and each time she dies, she must start over from the beginning. Returnal is known for its challenging gameplay, atmospheric visuals, and innovative use of the roguelike genre. Players must use a variety of weapons and abilities to battle enemies, solve puzzles, and explore the planetoid. The game also features a unique 'loop mechanic' that allows Selene to retain certain items and abilities between deaths. Returnal was a critical and commercial success, receiving praise for its gameplay, visuals, and story. The game has been awarded numerous accolades, including the Game of the Year award from IGN.",
    "price": 79.99,
    "image": "https://i0.wp.com/caniplaythat.com/wp-content/uploads/2021/04/Returnal_20210420113414-scaled.jpg?fit=2560%2C1440&ssl=1",
    "trailer": "https://www.youtube.com/watch?v=Jv4BjWoB-NA",
    "PS": "https://www.playstation.com/en-us/games/returnal/",
    "XB": "",
    "Switch": "",
    "PC": "https://store.steampowered.com/app/1649240/Returnal/"
  },
  {
    "title": "What Remains of Edith Finch",
    "linkTitle": "what-remains-of-edith-finch",
    "genres": [
      "Adventure",
      "Walking simulator"
    ],
    "rating": 4.9,
    "cardDescription": "A walking simulator with a unique story-telling style. You play as Edith Finch, who is exploring her family's home after they have all died in mysterious ways.",
    "gameOverview": "What Remains of Edith Finch is a first-person narrative adventure game developed by Giant Sparrow and published by Annapurna Interactive. It was released for Microsoft Windows, PlayStation 4, and Xbox One on April 25, 2017. The game follows Edith Finch, the last living member of the Finch family, as she returns to her ancestral home to explore the family history. What Remains of Edith Finch is a collection of short stories, each of which tells the story of a different Finch family member. Players explore the Finch house, uncovering clues and artifacts that tell the story of each family member's life and death. The game is played from a first-person perspective, and the gameplay is largely focused on exploration and storytelling. What Remains of Edith Finch was a critical and commercial success, receiving praise for its storytelling, atmosphere, and visuals. The game has been awarded numerous accolades, including the Game of the Year award from The Game Awards.",
    "price": 19.99,
    "image": "https://i0.wp.com/bounthavy.com/wp-content/uploads/2020/07/What-Remains-of-Edith-Finch-14.jpg?fit=1600%2C740&ssl=1",
    "trailer": "https://www.youtube.com/embed/C_y3cLSClBM?controls=0",
    "PS": "https://www.playstation.com/en-us/games/what-remains-of-edith-finch/",
    "XB": "https://www.xbox.com/en-US/games/store/what-remains-of-edith-finch/BSLGLG8P9T01/0001",
    "Switch": "https://www.nintendo.com/store/products/what-remains-of-edith-finch-switch/",
    "PC": "https://store.steampowered.com/app/501300/What_Remains_of_Edith_Finch/"
  },
  {
    "title": "Disco Elysium",
    "linkTitle": "disco-elysium",
    "genres": [
      "RPG",
      "Adventure"
    ],
    "rating": 4.9,
    "cardDescription": "A role-playing game with a focus on dialogue and choices. You play as a disgraced detective who is trying to solve a murder in a city full of corruption.",
    "gameOverview": "Disco Elysium is a non-linear, open world role-playing video game developed by ZA/UM and published by Deep Silver. It was released for Microsoft Windows, macOS and Linux on October 15, 2019. The game is set in Revachol, a fictional city in the post-war era. Players take on the role of Harry Du Bois, a disgraced detective who must investigate the murder of a woman. Disco Elysium is known for its unique gameplay, which is focused on dialogue and skill checks. Players can choose how to interact with the world and the characters they meet, and their choices will have a lasting impact on the game. The game also features a complex skill system, which allows players to develop their character's abilities in a variety of ways. Disco Elysium was a critical and commercial success, receiving praise for its writing, gameplay, and atmosphere. The game has been awarded numerous accolades, including the Game of the Year award from The Game Awards.",
    "price": 29.99,
    "image": "https://discoelysium.iam8bit.com/storage/static/share.jpg",
    "trailer": "https://www.youtube.com/embed/UWWA1jnI5N4?controls=0",
    "PS": "https://www.playstation.com/en-us/games/disco-elysium/",
    "XB": "https://www.xbox.com/en-US/games/store/disco-elysium-the-final-cut/9NTRS771L8HL/0010",
    "Switch": "https://www.nintendo.com/store/products/disco-elysium-the-final-cut-switch/",
    "PC": "https://store.steampowered.com/app/632470/Disco_Elysium__The_Final_Cut/"
  },
  {
    "title": "Firewatch",
    "linkTitle": "firewatch",
    "genres": [
      "Adventure",
      "Walking simulator"
    ],
    "rating": 4.8,
    "cardDescription": "A narrative adventure game set in a remote wilderness. You play as Henry, a fire lookout who is trying to find a missing hiker.",
    "gameOverview": "Firewatch is a first-person exploration adventure game developed by Campo Santo and published by Panic. It was released for Microsoft Windows, macOS, Linux, PlayStation 4, and Xbox One on September 2, 2016. The game is set in 1989 in the Shoshone National Forest in Wyoming. Players take on the role of Henry, a fire lookout who is tasked with monitoring the forest for fires. Firewatch is known for its atmospheric visuals, exploration-focused gameplay, and engaging story. Players explore the forest, interacting with the environment and the few other characters they encounter. The game also features a unique dialogue system, which allows players to choose how they want to interact with the world. Firewatch was a critical and commercial success, receiving praise for its storytelling, atmosphere, and visuals. The game has been awarded numerous accolades, including the Game of the Year award from The Game Developers Choice Awards.",
    "price": 19.99,
    "image": "https://variety.com/wp-content/uploads/2018/04/firewatch.png",
    "trailer": "https://www.youtube.com/embed/HdUYYnfRdl8",
    "PS": "https://store.playstation.com/en-us/product/UP0146-CUSA04107_00-FIREWATCH0000000",
    "XB": "https://www.xbox.com/en-us/games/store/firewatch/bqqkg9h2stc0",
    "Switch": "https://www.nintendo.com/store/products/firewatch-switch/",
    "PC": "https://store.steampowered.com/app/383870/Firewatch/"
  },
  {
    "title": "Inside",
    "linkTitle": "inside",
    "genres": [
      "Adventure",
      "Puzzle-platformer"
    ],
    "rating": 4.9,
    "cardDescription": "A puzzle-platformer with a dark and disturbing atmosphere. It's a short game, but it's definitely worth playing.",
    "gameOverview": "Inside is a puzzle-platformer video game developed by Playdead and published by Playdead, Xbox Game Studios, and Electronic Arts. It was released for Microsoft Windows, PlayStation 4, and Xbox One on June 29, 2016. The game is set in a dystopian world and follows a young boy who must solve puzzles and avoid enemies in order to escape. Inside is known for its minimalist graphics, atmospheric sound design, and challenging puzzles. Players must explore the world, interact with objects, and solve puzzles in order to progress. The game also features a number of environmental hazards, such as spikes and lasers, that players must avoid. Inside was a critical and commercial success, receiving praise for its gameplay, atmosphere, and visuals. The game has been awarded numerous accolades, including the Game of the Year award from several publications",
    "price": 19.99,
    "image": "https://cdn.mobygames.com/screenshots/3972415-inside-windows-title-screen.jpg",
    "trailer": "https://www.youtube.com/watch?v=yDm6PAgNohU",
    "PS": "https://www.playstation.com/en-us/games/inside/",
    "XB": "https://www.xbox.com/en-US/games/store/inside/C17GQF31D617/0001",
    "Switch": "https://www.nintendo.com/store/products/inside-switch/",
    "PC": "https://store.steampowered.com/app/304430/INSIDE/"
  }
  ] 